Workspace/run/04-sineWaveDamping-outlet-pressure-NRINSCBC-backward-etaAc100/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs ("libwaveTransmision.so" "libpressureOutletNSCBC.so" "libpressureInletNSCBC.so" "libtemperatureOutletNSCBC.so");
application     rhoPimpleFoam;

startFrom    startTime;

startTime    0;

stopAt          endTime;

endTime    0.0112;

deltaT     2.0e-6;

writeControl    runTime;

writeInterval    2.0e-4;

purgeWrite    0;

writeFormat    ascii;

writePrecision  16;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable    true;

adjustTimeStep  no;

maxCo           0.3;

maxDeltaT       1;


functions
{

    #includeFunc mag(U)
    fieldAverage
    {
        type            fieldAverage;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        fields
        (
            U
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }

        );
    }
}

// ************************************************************************* //
